{"backend": "tensorflow", "config": {"name": "model_2", "layers": [{"name": "input_3", "config": {"batch_input_shape": [null, 34], "sparse": false, "dtype": "float32", "name": "input_3"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_2", "config": {"batch_input_shape": [null, 2048], "sparse": false, "dtype": "float32", "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"activity_regularizer": null, "trainable": false, "embeddings_regularizer": null, "mask_zero": true, "input_dim": 1652, "output_dim": 200, "dtype": "float32", "batch_input_shape": [null, null], "input_length": null, "name": "embedding_1", "embeddings_constraint": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"activation": "tanh", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "implementation": 1, "return_state": false, "recurrent_dropout": 0.0, "go_backwards": false, "return_sequences": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_regularizer": null, "stateful": false, "use_bias": true, "name": "lstm_1", "unroll": false, "bias_constraint": null}, "class_name": "LSTM", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"units": 1652, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "use_bias": true, "name": "dense_3", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4"}