{"config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 34], "name": "input_3", "sparse": false, "dtype": "float32"}, "name": "input_3", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 2048], "name": "input_2", "sparse": false, "dtype": "float32"}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"mask_zero": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "trainable": false, "activity_regularizer": null, "dtype": "float32", "embeddings_regularizer": null, "input_dim": 1652, "name": "embedding_1", "batch_input_shape": [null, null], "input_length": null, "embeddings_constraint": null, "output_dim": 200}, "name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"trainable": true, "bias_regularizer": null, "units": 256, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"return_state": false, "implementation": 1, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "unroll": false, "unit_forget_bias": true, "kernel_regularizer": null, "go_backwards": false, "use_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "stateful": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "bias_constraint": null, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "units": 256}, "name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "name": "add_1", "class_name": "Add", "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"config": {"trainable": true, "bias_regularizer": null, "units": 256, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"trainable": true, "bias_regularizer": null, "units": 1652, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "output_layers": [["dense_3", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}